app/Http/Controllers/Auth/LoginController.php

select * from `restaurants` where `restaurants`.`uid` in (1)
select * from `users` where `role` = 'RESTAURANT' and (`email_id` = 'testnct01@gmail.com' or `mobile_number` = 'testnct01@gmail.com') and `users`.`deleted_at` is null limit 1
select * from `restaurant_payment` where `restaurant_id` = 1 and `uid` = 1 limit 1
---
    public function login(LoginRequest $request)
    {
        $username = $request->post('username');
        $user = User::where('role', Config::get('constants.ROLES.RESTAURANT'))
            ->where(function ($query) use ($username) {
                $query->where('email_id', $username);
                $query->orWhere('mobile_number', $username);
            })->with('restaurant')->first();
        if (!$user) {
            return redirect()->route('login')->with('error', 'Please enter valid email or phone.');
        } else if (!$user->is_verified_at) {
            return redirect()->route('login')->with('error-verify', 'Please verify this account. <a class="verify-link" href="'.route('account.active.request').'">Verify Now</a>');
        }
        $payment = RestaurantPayment::where('restaurant_id', $user->restaurant->restaurant_id)->where('uid', $user->uid)->first();