app/Http/Controllers/Api/Restaurant/ChatNumberController.php

    public function index(Request $request)
    {
        try {
            $validator = Validator::make($request->all(), [
                'restaurant_id' => 'required',
            ]);
            if ($validator->fails()) {
                return response()->json(['success' => false, 'message' => $validator->errors()], 400);
            }
            $order = Order::where('restaurant_id', $request->restaurant_id)->with('user')->get();
---
select * from `orders` where `restaurant_id` = 1
select * from `users` where `users`.`uid` in (2, 15) and `users`.`deleted_at` is null