app/Http/Controllers/Api/Restaurant/PromotionController.php

    public function active(Request $request)
    {
        try {
            $request_data = $request->json()->all();
                $validator = Validator::make($request_data, [
                'restaurant_id' => 'required',
                'promotion_id' => 'required',
                'status' => 'required'
            ]);
            if ($validator->fails()) {
                return response()->json(['success' => false, 'message' => $validator->errors()], 400);
            }
            $promotion =  Promotion::where('promotion_id',$request->post('promotion_id'))->first();
            $promotion->status = $request->post('status');
            $promotion->save();
---
select * from `promotions` where `promotion_id` = 41 limit 1
update `promotions` set `status` = 'ACTIVE', `promotions`.`updated_at` = '2024-11-19 11:07:43' where `promotion_id` = 41