app/Http/Controllers/Api/Restaurant/ReportController.php

            // ----------------------------- request data fetch ----------------------------

            $uid = Auth::user()->uid;
    	    $user = User::where('uid', $uid)->first();
            $restaurant = Restaurant::where('uid', $uid)->first();
---
select * from `users` where `uid` = 1 and `users`.`deleted_at` is null limit 1
select * from `restaurants` where `uid` = 1 limit 1


            // --------------------------------- order data logic ------------------------------------

            $result['all_order'] = Order::where('restaurant_id',$restaurant ->restaurant_id)->count();

            $result['get_order'] = Order::where('restaurant_id',$restaurant ->restaurant_id)
            ->whereBetween('order_date',[$duration])
            ->count();

            $sub_duration_orders = Order::where('restaurant_id',$restaurant ->restaurant_id)
            ->whereBetween('order_date',[$comparison_duration])
            ->count();
---
select count(*) as aggregate from `orders` where `restaurant_id` = 1
select count(*) as aggregate from `orders` where `restaurant_id` = 1 and `order_date` between '' and ''
select count(*) as aggregate from `orders` where `restaurant_id` = 1 and `order_date` between '1969-12-31' and '1969-12-31'


            // --------------------------------- pending order data logic ends ------------------------------------

            $result['all_pendingorder'] = Order::where('restaurant_id',$restaurant ->restaurant_id)
            ->where('order_progress_status',Config::get('constants.ORDER_STATUS.INITIAL'))
            ->whereNull('order_status')
            ->count();

            $result['get_pendingorder'] = Order::where('restaurant_id',$restaurant ->restaurant_id)
            ->where('order_progress_status',Config::get('constants.ORDER_STATUS.INITIAL'))
            ->whereNull('order_status')
            ->whereBetween('order_date',[$duration])
            ->count();

            $sub_duration_pending_orders = Order::where('restaurant_id',$restaurant ->restaurant_id)
            ->where('order_progress_status',Config::get('constants.ORDER_STATUS.INITIAL'))
            ->whereNull('order_status')
            ->whereBetween('order_date',[$comparison_duration])
            ->count();
---
select count(*) as aggregate from `orders` where `restaurant_id` = 1 and `order_progress_status` = 'INITIAL' and `order_status` is null
select count(*) as aggregate from `orders` where `restaurant_id` = 1 and `order_progress_status` = 'INITIAL' and `order_status` is null and `order_date` between '' and ''
select count(*) as aggregate from `orders` where `restaurant_id` = 1 and `order_progress_status` = 'INITIAL' and `order_status` is null and `order_date` between '1969-12-31' and '1969-12-31'


            // --------------------------------- Delivery data logic  ------------------------------------

            $result['all_delivery'] = Order::where('restaurant_id',$restaurant ->restaurant_id)
            ->where('order_progress_status',Config::get('constants.ORDER_STATUS.COMPLETED'))
            ->count();

            $result['get_delivery'] = Order::where('restaurant_id',$restaurant ->restaurant_id)
            ->where('order_progress_status',Config::get('constants.ORDER_STATUS.COMPLETED'))
            ->whereBetween('order_date',[$duration])
            ->count();

            $sub_duration_deliveries = Order::where('restaurant_id',$restaurant ->restaurant_id)
            ->where('order_progress_status',Config::get('constants.ORDER_STATUS.COMPLETED'))
            ->whereBetween('order_date',[$comparison_duration])
            ->count();
---
select count(*) as aggregate from `orders` where `restaurant_id` = 1 and `order_progress_status` = 'COMPLETED'
select count(*) as aggregate from `orders` where `restaurant_id` = 1 and `order_progress_status` = 'COMPLETED' and `order_date` between '' and ''
select count(*) as aggregate from `orders` where `restaurant_id` = 1 and `order_progress_status` = 'COMPLETED' and `order_date` between '1969-12-31' and '1969-12-31'


            // --------------------------------- clients data logic  ------------------------------------

            $result['all_clients'] = User::where('role',Config::get('constants.ROLES.CUSTOMER'))->where('status','ACTIVE')->count();

            $result['new_client'] = User::where('role',Config::get('constants.ROLES.CUSTOMER'))
            ->where('status','ACTIVE')
            ->whereBetween('created_at',[$duration])
            ->count();

            $result['reporting_client'] = 0;

            $users = User::where('role',Config::get('constants.ROLES.CUSTOMER'))->where('status','ACTIVE')->get();

            foreach ($users as $key => $user) {
                $user->orders->count() > 0 ? $result['reporting_client']++ : "";
---
select count(*) as aggregate from `users` where `role` = 'CUSTOMER' and `status` = 'ACTIVE' and `users`.`deleted_at` is null
select count(*) as aggregate from `users` where `role` = 'CUSTOMER' and `status` = 'ACTIVE' and `created_at` between '' and '' and `users`.`deleted_at` is null
select * from `users` where `role` = 'CUSTOMER' and `status` = 'ACTIVE' and `users`.`deleted_at` is null
select * from `orders` where `orders`.`uid` = 2 and `orders`.`uid` is not null


            // --------------------------------- Sales data logic  -----------------------------------------

            $result['all_sales'] = Order::where('restaurant_id',$restaurant ->restaurant_id)->sum('grand_total');

            $result['sales_total'] = Order::where('restaurant_id',$restaurant ->restaurant_id)
            ->whereBetween('created_at',[$duration])
            ->sum('grand_total');

            $sub_duration_sales = Order::where('restaurant_id',$restaurant ->restaurant_id)
            ->whereBetween('created_at',[$comparison_duration])
            ->sum('grand_total');
---
select sum(`grand_total`) as aggregate from `orders` where `restaurant_id` = 1
select sum(`grand_total`) as aggregate from `orders` where `restaurant_id` = 1 and `created_at` between '' and ''
select sum(`grand_total`) as aggregate from `orders` where `restaurant_id` = 1 and `created_at` between '1969-12-31' and '1969-12-31'


            // --------------------------------- tip data logic -------------------------------------------

            $result['all_tip'] = number_format(Order::where('restaurant_id',$restaurant ->restaurant_id)->sum('tip_amount'),2);

            $result['total_tip'] = Order::where('restaurant_id',$restaurant ->restaurant_id)
            ->whereBetween('order_date',[$duration])
            ->sum('tip_amount');
---
select sum(`tip_amount`) as aggregate from `orders` where `restaurant_id` = 1
select sum(`tip_amount`) as aggregate from `orders` where `restaurant_id` = 1 and `order_date` between '' and ''