app/Http/Controllers/Api/Restaurant/RestaurantHoursController.php

select * from `restaurant_hours` where `day` = 'monday1' and `restaurant_id` = '1' limit 1
---
    public function add(Request $request)
    {
        try {

            $validator = Validator::make($request->all(), [
                'restaurant_id' => 'required',
                // 'opening_time' => 'required',
                'days'=>'required',
                'hours' => 'required',
                // 'closing_time' => 'required'
            ]);

            if ($validator->fails()) {
                return response()->json(['success' => false, 'message' => $validator->errors()], 400);
            }

            $days='';
            $menuRow =array();
            $requestDays = explode(",",$request->post('days'));
            $requestHours = $request->post('hours');

            if(is_array($requestDays)){
                foreach ($requestDays as $key => $value) {
                    $countRestaurantHours = RestaurantHours::where('day',strtolower($value))
                    ->where('restaurant_id',$request->post('restaurant_id'))
                    ->first();

select * from `restaurant_hours` where `restaurant_id` = '1' order by `hours_group_id` desc
---
                return response()->json(['success' => false, 'message' => 'Please enter unique '.$days.' days'], 400);
            }

            $countRestaurantHours = RestaurantHours::where('restaurant_id',$request->post('restaurant_id'))
                                    ->orderBy('hours_group_id','desc')
                                    ->get();

select * from `restaurant_hours` where `day` = 'monday' and `restaurant_id` = '1' and `hours_group_id` != '2' limit 1
---
    public function update(Request $request)
    {
        try {
            $validator = Validator::make($request->all(), [
                'restaurant_id' => 'required',
                // 'opening_time' => 'required',
                'hours_group_id'=>'required',
                'days'=>'required',
                'hours' => 'required',
                // 'closing_time' => 'required'
            ]);
            if ($validator->fails()) {
                return response()->json(['success' => false, 'message' => $validator->errors()], 400);
            }

            $days='';
            $menuRow =array();
            $requestDays = explode(",",$request->post('days'));
            $requestHours = $request->post('hours');
            if(is_array($requestDays)){
                foreach ($requestDays as $key => $value) {
                    $countRestaurantHours = RestaurantHours::where('day',strtolower($value))
                    ->where('restaurant_id', $request->post('restaurant_id'))
                    ->where('hours_group_id','!=', $request->post('hours_group_id'))
                    ->first();

delete from `restaurant_hours` where `hours_group_id` = '2'
delete from `restaurant_hours_times` where `hours_group_id` = '2'
---
                return response()->json(['success' => false, 'message' => 'Please enter unique '.$days.' days'], 400);
            }

            RestaurantHours::where('hours_group_id', $request->post('hours_group_id'))->delete();
            RestaurantHoursTimes::where('hours_group_id',$request->post('hours_group_id'))->delete();