app/Http/Controllers/Api/Restaurant/RestaurantHoursController.php

                $data[$key]['closing_time'] = $request->post('closing_time');
            }
            $hour = new RestaurantHours;
            if($hour->insert($data)){
---
insert into `restaurant_hours` (`restaurant_id`, `hours_group_id`, `day`, `updated_at`, `created_at`) values ('1', 3, 'monday1', '2024-11-19 13:50:59', '2024-11-19 13:50:59')