app/Http/Controllers/Api/Restaurant/StockController.php

select * from `menu_items` where `menu_id` = 220 limit 1
---
    public function index(Request $request)
    {
        try {
            $validator = Validator::make($request->all(), [
                'restaurant_id' => 'required',
                'item_id' => 'required',
                'item_available_type' =>'required'
            ]);
            if ($validator->fails()) {
                return response()->json(['success' => false, 'message' => $validator->errors()], 400);
            }
            $result = MenuItem::where('menu_id',$request->item_id)->first();