app/Http/Controllers/Api/Restaurant/UserController.php

insert into `users` (`first_name`, `last_name`, `email_id`, `mobile_number`, `password`, `role`, `app_notifications`, `chat_notifications`, `location_tracking`, `otp`, `otp_valid_time`, `status`, `updated_at`, `created_at`) values ('restaurant', 'restaurant', 'jerryp.dotpitchtechnologies@gmail.com', '9157676509', '$2y$10$XByencpzexl9S3sgn/EZzOCnNePjp68hSIw2jpb68Ggcq8wJxzECa', 'RESTAURANT', 0, 0, 0, 1234, '2024-11-26 03:11:32', 'INACTIVE', '2024-11-26 02:56:32', '2024-11-26 02:56:32')
---
            $user->otp = 1234;
            $user->otp_valid_time = Carbon::now()->addMinutes(Config::get('constants.OTP_VALID_DURATION'));
            $user->status = Config::get('constants.STATUS.INACTIVE');
            $user->save();

insert into `restaurants` (`uid`, `restaurant_name`, `restaurant_state`, `restaurant_city`, `restaurant_zip`, `restaurant_address`, `updated_at`, `created_at`) values (276, 'Pop Delis', 'gujarat', 'rajkot', '3698520', 'rajkot', '2024-11-26 02:56:37', '2024-11-26 02:56:37')
---
            $restaurant->restaurant_city = $request->post('restaurant_city');
            $restaurant->restaurant_zip = $request->post('restaurant_zip');
            $restaurant->restaurant_address = $request->post('restaurant_address');
            $restaurant->save();