app/Http/Controllers/customer/CartController.php

    public function addToCart(Request $request)
    {

        $uid = auth()->id();
        $cart = Cart::where('uid',$uid)->first();
        $menuItem = MenuItem::where('menu_id',$request->menuId)->first();
---
select * from `carts` where `uid` = 2 limit 1
select * from `menu_items` where `menu_id` = '214' limit 1

        $cartMenuItemData->modifier_total = $menuItem->item_price;
        $cartMenuItemData->is_loyalty = $isloyalty;
        $cartMenuItemData->loyalty_point = $loyaltyPoints;
        $cartMenuItemData->save();
        if(isset($request->modifierItems)){
            $modifierItems = $request->modifierItems;
            foreach($modifierItems as $modifier_group_id => $modifier_group_item_ids){
                $modifier = ModifierGroup::select('modifier_group_id','modifier_group_name')->where('modifier_group_id', $modifier_group_id)->first();
---
insert into `cart_menu_items` (`cart_id`, `category_id`, `menu_id`, `menu_name`, `menu_qty`, `menu_price`, `item_img`, `modifier_total`, `is_loyalty`, `loyalty_point`, `updated_at`, `created_at`) values (175, 131, 214, 'Agedashi Tofu', 1, 9, '', 9, 0, 0, '2024-11-26 12:04:00', '2024-11-26 12:04:00')
select `modifier_group_id`, `modifier_group_name` from `modifier_groups` where `modifier_group_id` = 166 limit 1

    public function removeItem(Request $request)
    {
        $cart = Cart::where('uid', auth()->id())->first();
---
select * from `carts` where `uid` = 2 limit 1