app/Http/Controllers/customer/FeedbackController.php

insert into `customer_feedback` (`restaurant_id`, `uid`, `name`, `phone`, `email`, `feedback_type`, `suggestion`, `updated_at`, `created_at`) values (1, 2, 'Jery FOTO', '09157676509', 'jeryfoto@gmail.com', 'General Feedback', 'Merci pour la confiance que vous m\'accordez 😊', '2024-11-26 02:05:19', '2024-11-26 02:05:19')
---
    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required',
            'phone_number'  => 'required',
            'email' => 'required',
            'feedback_type' => 'required',
            'message'   => 'required'
        ]);

        $restaurantId = session()->get('restaurantId');
        $uid = Auth::user()->uid;

        $feedback = New CustomerFeedback;
        $feedback->restaurant_id = $restaurantId;
        $feedback->uid = $uid;
        $feedback->name = $request->name;
        $feedback->phone = $request->phone_number;
        $feedback->email = $request->email;
        $feedback->feedback_type = $request->feedback_type;
        $feedback->suggestion = $request->message;
        if($feedback->save())