app/Http/Controllers/customer/HomeController.php

    public function index()
    {
        $restaurantId = 1;
        if (Auth::check()) {
            $uid = Auth::user()->uid;
            $data['cards'] = getUserCards($restaurantId, $uid);
        }
        $promotionLists = Promotion::where('restaurant_id', $restaurantId);
        $data['promotionLists'] = $promotionLists->get();
        $data['categories'] = Category::where('restaurant_id', $restaurantId)->latest()->get();
---
select * from `promotions` where `restaurant_id` = 1
select * from `categories` where `restaurant_id` = 1 order by `created_at` desc

    public function getMenuItems(Request $request)
    {
        $categoryId = $request->post('categoryId');
        $restaurantId = 1;
        $data['cart'] = $cart = getCart($restaurantId);
        $data['cartMenuItems'] = getCartQty();
        $data['cartMenuItemIds'] = !empty($cart) ? array_column($cart->cartMenuItems->toArray(),'menu_id','cart_menu_item_id') : [];
        $data['category'] = Category::where('restaurant_id', $restaurantId)->where('category_id', $categoryId)->first();
        $data['menuItems'] = MenuItem::with('modifierList','modifierList.modifier_item')->where('restaurant_id', $restaurantId)->where('category_id', $categoryId)->get();
---
select * from `categories` where `restaurant_id` = 1 and `category_id` = '131' limit 1
select * from `menu_items` where `restaurant_id` = 1 and `category_id` = '131'