app/Http/Controllers/customer/HoursController.php

    public function index()
    {
        $uid = Auth::user()->uid;
        $restaurantId = session()->get('restaurantId');
        $restaurant = Restaurant::where('restaurant_id', $restaurantId)->with('user')
            ->first();
---
select * from `restaurants` where `restaurant_id` = 1 limit 1
select * from `users` where `users`.`uid` in (1) and `users`.`deleted_at` is null

    public function sendMail(Request $request)
    {
        // dd($request->all());
        $request->validate([
            'name' => 'required|string',
            'phone_number' => 'required|numeric',
            'email' => 'required|email',
            'message' => 'required',
        ]);
        $restaurantId = session()->get('restaurantId');
        $restaurant = Restaurant::with('user')->where('restaurant_id', $restaurantId)->first();
---
select * from `restaurants` where `restaurant_id` = 1 limit 1
select * from `users` where `users`.`uid` in (1) and `users`.`deleted_at` is null