app/Http/Controllers/customer/LoginController.php

    public function attemptLogin(Request $request)
    {
        $username = $request->post('username');
        $restaurantId = 1;
        $user = User::where('role', Config::get('constants.ROLES.CUSTOMER'))
            ->whereHas('restaurant_user', function ($query) use ($restaurantId) {
                $query->where('restaurant_id', $restaurantId);
            })
            ->where(function ($query) use ($username) {
                $query->where('email_id', $username);
                $query->orWhere('mobile_number', $username);
            })->first();
---
select * from `restaurant_users` where `restaurant_users`.`uid` = 2 and `restaurant_users`.`uid` is not null
select * from `users` where `role` = 'CUSTOMER' and exists (select * from `restaurant_users` where `users`.`uid` = `restaurant_users`.`uid` and `restaurant_id` = 1) and (`email_id` = 'customer@gmail.com' or `mobile_number` = 'customer@gmail.com') and `users`.`deleted_at` is null limit 1