app/Http/Controllers/customer/ProfileController.php

    public function profile()
    {
        if (Auth::check()) {
            $data['customer'] = User::with('address')->findOrFail(Auth::user()->uid);
            $restaurantId = 1;
            $uid = Auth::user()->uid;
            $data['cards'] = getUserCards($restaurantId, $uid);
            $data['title'] = 'Profile';

            $data['addresses'] = CustomerAddress::where('uid', $uid)->get();
---
select * from `users` where `users`.`uid` = 2 and `users`.`deleted_at` is null limit 1
select * from `customer_addresses` where `uid` = 2