app/Http/Controllers/customer/PromotionController.php

    public function index()
    {
        $data['promotionLists'] = Promotion::where('restaurant_id', getRestaurantId())
            ->with('promotion_item')
            ->get();
---
select * from `promotions` where `restaurant_id` = 1