app/helpers/custom.php

select `card_id`, `card_holder_name`, `card_number`, `card_expire_date`, `card_cvv`, `card_type`, `status` from `cards` where `uid` = 2 and `restaurant_id` = 1 order by `card_id` desc
---
    function getUserCards($restaurantId, $uid)
    {
        if (\Auth::check()) {
            $cards = Card::where('uid', $uid)->where('restaurant_id', $restaurantId)->orderBy('card_id', 'desc')->get(['card_id', 'card_holder_name', 'card_number', 'card_expire_date', 'card_cvv', 'card_type', 'status']);

select `cart_id`, `restaurant_id`, `promotion_id`, `uid`, `sub_total`, `discount_charge`, `tax_charge`, `total_due`, `is_payment` from `carts` where `restaurant_id` = 1 and `uid` = 2 limit 1
select `cart_menu_item_id`, `cart_id`, `menu_id`, `menu_name`, `menu_qty`, `menu_price`, `menu_total`, `modifier_total`, `is_loyalty`, `item_img`, `loyalty_point` from `cart_menu_items` where `cart_menu_items`.`cart_id` in (175)
select `cart_modifier_group_id`, `cart_menu_item_id`, `menu_id`, `modifier_group_id`, `modifier_group_name` from `cart_menu_groups` where `cart_menu_groups`.`cart_menu_item_id` in (360, 361, 364, 365, 366, 367, 368, 369, 370)
---
    function getCart($restaurant_id = 1)
    {
        $uid = auth()->user()->uid ?? 0;
        return $cartItems = Cart::with(['cartMenuItems' => function($query){
            $query->select(['cart_menu_item_id','cart_id','menu_id','menu_name','menu_qty','menu_price','menu_total','modifier_total','is_loyalty','item_img','loyalty_point'])->with(['cartMenuGroups' => function($query){
                $query->select(['cart_modifier_group_id','cart_menu_item_id','menu_id','modifier_group_id','modifier_group_name'])->with('cartMenuGroupItems')->get();
            }])->get();
        }])->with('cartResturant')->where('restaurant_id',$restaurant_id)->where('uid',$uid)->select('cart_id','restaurant_id','promotion_id','uid','sub_total','discount_charge','tax_charge','total_due','is_payment')->first();