app/Http/Controllers/AccountController.php

    public function index(){
        $uid = Auth::user()->uid;
        $user = User::where('uid', $uid)->first();
        $restaurant = Restaurant::where('uid',$user->uid)->first();
---
select * from `users` where `uid` = 1 and `users`.`deleted_at` is null limit 1
select * from `restaurants` where `uid` = 1 limit 1