app/Http/Controllers/ChatController.php

select * from `restaurants` where `uid` = 1 limit 1
select * from `orders` where `restaurant_id` = 1 and `order_progress_status` in ('PREPARED', 'ACCEPTED', 'ORDER DUE')
select * from `users` where `users`.`uid` in (2, 15) and `users`.`deleted_at` is null
---
   public function index(Request $request){

        try{
            $database = app('firebase.database');
            $user = Auth::user()->uid;
            $restaurant = Restaurant::where('uid', $user)->first();
            $orders = Order::where('restaurant_id', $restaurant->restaurant_id)
            ->whereIn('order_progress_status',[
                Config::get('constants.ORDER_STATUS.PREPARED'),
                Config::get('constants.ORDER_STATUS.ACCEPTED'),
                Config::get('constants.ORDER_STATUS.ORDER_DUE')
            ])
            ->with('user');
            $orderNumber = $request->order_number;
            if($orderNumber){
                $orders = $orders->where('order_number','like','%'.$orderNumber.'%');
            }
            $orders = $orders->get();

select * from `users` where `uid` = '2' and `users`.`deleted_at` is null limit 1
select * from `restaurants` where `uid` = 1 limit 1
---
    public function sendMessages(Request $request) {
        try{
            $database = app('firebase.database');
            $order_id =  $request->order_id;
            $customer_id= $request->customer_id;
            $uid=$request->uid;
            $user = User::where('uid',$customer_id)->first();
                // Create a key for a new post
            $user_id = Auth::user()->uid;

            $userid=Auth::user();
            $postData =(object) [
                'full_name' => $user->first_name." ".$user->last_name,
                'message' => $request->message,
                'message_date'=>date("Y-m-d H:i A"),
                'isseen'=>false,
                'order_number'=>$order_id,
                'receiver'=>$customer_id,
                'sender'=>$user_id,
                'sent_from'=> Config::get('constants.ROLES.RESTAURANT'),
                'user_id'=>$customer_id
            ];
            $restaurant = Restaurant::where('uid', $user_id)->first();

select * from `users` where `uid` = '2' and `users`.`deleted_at` is null limit 1
---


            // $FcmToken = User::whereNotNull('device_key')->pluck('device_key')->all();
            $FcmTokenData = User::where('uid', $request->uid)->first();

select * from `restaurants` where `uid` = 1 limit 1
select * from `orders` where `order_number` = '137385809604512' and `restaurant_id` = 1 limit 1
update `orders` set `customer_msg_count` = 0, `orders`.`updated_at` = '2024-11-19 07:02:51' where `order_number` = '137385809604512' and `restaurant_id` = 1
---
    public function readChatMessage(Request $request)
    {
        if ($request->ajax()) {
            $uid = Auth::user()->uid;
            $restaurant = Restaurant::where('uid', $uid)->first();
            $restaurantId = $restaurant->restaurant_id;
            $orderNumber = $request->post('order_number');
            $order = Order::where('order_number',$orderNumber)->where('restaurant_id', $restaurantId)->first();
            if($order){
                $database = app('firebase.database');
                $url = Config::get('constants.FIREBASE_DB_NAME') . "/" . $restaurantId . "/" . $order->order_number . "/" . $order->uid . "/";
                $messages = $database->getReference($url)->getvalue();
                if($messages){
                    foreach ($messages as $key => $value) {
                        if ($value['sent_from'] == Config::get('constants.ROLES.CUSTOMER')) {
                            $value['isseen'] = true;
                            $updateUrl = $url.'/'.$key.'/';
                            $updates[$updateUrl]  = $value;
                            $database->getReference()->update($updates);
                            if($order->customer_msg_count > 0){
                                $messageCount = 0;
                                Order::where('order_number',$orderNumber)->where('restaurant_id', $restaurantId)->update(['customer_msg_count' => $messageCount]);