app/Http/Controllers/DashboardController.php

select * from `restaurants` where `uid` = 1 limit 1
select * from `orders` where (`restaurant_id` = 1 and `order_progress_status` = 'ORDER DUE') order by `pickup_time` asc
select * from `orders` where (`restaurant_id` = 1 and `order_progress_status` = 'ACCEPTED') order by `pickup_time` asc
---
    public function index(Request $request)
    {
        $uid = Auth::user()->uid;
        $restaurant = Restaurant::where('uid', $uid)->first();
        $orders = [];

        // -------------- due orders -----------------

        $due_orders = Order::where([
                'restaurant_id' => $restaurant->restaurant_id,
                'order_progress_status'=>'ORDER DUE'
        ])
        ->orderBy('pickup_time')->get();

        foreach ($due_orders as $key => $order) {
            $orders[] = $order;
        }


        // -------------- Accepted orders -----------------

        $accepted_orders = Order::where([
            'restaurant_id' => $restaurant->restaurant_id,
            'order_progress_status'=>'ACCEPTED'
        ])
        ->orderBy('pickup_time')->get();

select * from `orders` where (`restaurant_id` = 1 and `order_progress_status` = 'INITIAL' and `order_status` is null)
---

        // -------------- Initial orders -----------------

        $initial_orders = Order::where([
            'restaurant_id' => $restaurant->restaurant_id,
            'order_progress_status'=>'INITIAL',
            'order_status' => NULL
        ])->get();