app/Http/Controllers/Api/Customer/CartController.php

update `users` set `total_points` = 1953, `users`.`updated_at` = '2024-11-19 12:36:49' where `uid` = 2
select * from `carts` where `uid` = 2 and `restaurant_id` = 1 limit 1
---
    public function store(Request $request)
    {
        try {
            $request_data = $request->json()->all();
            $validator = Validator::make($request_data, [
                'restaurant_id' => 'required',
                'menu_item' => 'required',
                // 'is_loyalty'  =>  'required',
            ]);

            $user = Auth::user();
            foreach ($request->post('menu_item') as $menu_item) {
                if ($menu_item['is_loyalty'] == true) {
                    $user->update(['total_points' => $user->total_points - $menu_item['loyalty_point']]);
                }
            }

            if ($validator->fails()) {
                return response()->json(['success' => false, 'message' => $validator->errors()], 400);
            }
            $uid = auth('api')->user()->uid;
            // $restaurant = Restaurant::where('restaurant_id',$request->post('restaurant_id'))->first();
            // $salesTax = $restaurant->sales_tax;
            $check_cart = Cart::where('uid', $uid)->where('restaurant_id', $request->post('restaurant_id'))->first();

insert into `cart_menu_items` (`cart_id`, `category_id`, `menu_id`, `menu_name`, `menu_qty`, `menu_price`, `modifier_total`, `menu_total`, `is_loyalty`, `loyalty_point`, `updated_at`, `created_at`) values (175, 61, 168, 'Chicken Veg Mixed', '1', '0.00', '0.00', '0.00', 1, 1, '2024-11-19 13:03:26', '2024-11-19 13:03:26')
---
                        $cart_sub_total += $menuItem['menu_total'];
                        $cartMenuItemData->is_loyalty = ($menuItem['is_loyalty'] == true) ? 1 : 0;
                        $cartMenuItemData->loyalty_point = $menuItem['loyalty_point'];
                        $cartMenuItemData->save();

delete from `cart_menu_items` where `cart_menu_item_id` = 362
---
                if (isset($request_data['cartmenuitemid'])) {
                    $cart_item = CartItem::where('cart_menu_item_id', $request_data['cartmenuitemid'])->first();
                    if ($cart_item->menu_qty == "1") {
                        $cartitemdelete = $cart_item->delete();

select * from `carts` where `uid` = 2 and `restaurant_id` = 1 limit 1
select * from `menu_items` where `menu_id` = 168 limit 1
---
    public function quantityIncrement(Request $request)
    {
        try {
            $request_data = $request->json()->all();
            $validator = Validator::make($request_data, [
                'restaurant_id' => 'required',
                'cart_menu_item_id' => 'required',
                'menu_id' => 'required'
            ]);

            if ($validator->fails()) {
                return response()->json(['success' => false, 'message' => $validator->errors()], 400);
            } else {
                $uid = auth('api')->user()->uid;
                $check_cart = Cart::where('uid', $uid)->where('restaurant_id', $request->post('restaurant_id'))->first();
                if ($check_cart) {
                    //   $cartItem = CartItem::where('cart_id',$check_cart->cart_id)->first();
                    $cartItem = CartItem::where('cart_menu_item_id', $request->post('cart_menu_item_id'))->where('menu_id', $request->post('menu_id'))->where('cart_id', $check_cart->cart_id)->first();
                    $menuItem = MenuItem::where('menu_id', $request->post('menu_id'))->first();

select * from `carts` where `uid` = 2 and `restaurant_id` = 1 limit 1
select * from `menu_items` where `menu_id` = 168 limit 1
---
    public function quantityDecrement(Request $request)
    {
        try {
            $request_data = $request->json()->all();
            $validator = Validator::make($request_data, [
                'restaurant_id' => 'required',
                'cart_menu_item_id' => 'required',
                'menu_id' => 'required'
            ]);

            if ($validator->fails()) {
                return response()->json(['success' => false, 'message' => $validator->errors()], 400);
            } else {
                $uid = auth('api')->user()->uid;
                $check_cart = Cart::where('uid', $uid)->where('restaurant_id', $request->post('restaurant_id'))->first();
                if ($check_cart) {
                    $cartItem = CartItem::where('cart_menu_item_id', $request->post('cart_menu_item_id'))->where('menu_id', $request->post('menu_id'))->where('cart_id', $check_cart->cart_id)->first();
                    $menuItem = MenuItem::where('menu_id', $request->post('menu_id'))->first();