app/Http/Controllers/Api/Customer/StripeController.php

select * from `cards` where `card_id` = '18' and `uid` = 2 limit 1
---
    public function createCharge(Request $request)
    {
        try {
            $request_data = $request->json()->all();

            $validator = Validator::make($request_data, [
                "amount" => "required",
                "currency" => "required",
                "source"  => "required",
                "card_id" => "required",
            ]);
            if ($validator->fails()) {
                return response()->json(['success' => false, 'message' => $validator->errors()], 400);
            }

            $uid = auth('api')->user()->uid;

            $get_card = Card::where('card_id', $request->post('card_id'))->where('uid', $uid)->first();