app/Http/Controllers/Api/Customer/UserController.php

            $user->otp = 1234;
            $user->otp_valid_time = Carbon::now()->addMinutes(Config::get('constants.OTP_VALID_DURATION'));
            $user->status = Config::get('constants.STATUS.INACTIVE');
            $user->save();
---
insert into `users` (`first_name`, `last_name`, `email_id`, `mobile_number`, `password`, `role`, `otp`, `otp_valid_time`, `status`, `updated_at`, `created_at`) values ('customer', 'customer', 'jerykhenson@gmail.com', '8141246886', '$2y$10$LSxZErIdJkAVvt6P33Ze7OgKv7BuKz2CBycMM7BrWjrntCzlyJhFW', 'CUSTOMER', 1234, '2024-11-26 01:44:40', 'INACTIVE', '2024-11-26 01:29:40', '2024-11-26 01:29:40')

            $restaurantUser->uid = $user->uid;
            $restaurantUser->restaurant_id = $request->post('restaurant_id');
            $restaurantUser->status = Config::get('constants.STATUS.ACTIVE');
            $restaurantUser->save();
---
insert into `restaurant_users` (`uid`, `restaurant_id`, `status`, `updated_at`, `created_at`) values (260, 1, 'ACTIVE', '2024-11-26 01:29:46', '2024-11-26 01:29:46')

            $user_address->save();
            DB::commit();

            $restaurant_detail = Restaurant::where('restaurant_id', $request->post('restaurant_id'))->first();
---
select * from `restaurants` where `restaurant_id` = 1 limit 1

    public function forgotPassword(Request $request)
    {
        try {
            $request_data = $request->json()->all();

            $validator = Validator::make($request_data, [
                'restaurant_id' => 'required',
                'email_id' => 'required_without:mobile_number|email',
                'mobile_number' => 'required_without:email_id|numeric',
            ]);
            if ($validator->fails()) {
                return response()->json(['success' => false, 'message' => $validator->errors()], 400);
            }
            $restaurantId = $request->post('restaurant_id');
            $email = $request->post('email_id');
            $mobile = $request->post('mobile_number');
            $user = User::where('role', Config::get('constants.ROLES.CUSTOMER'))
                ->where(function ($query) use ($email, $mobile) {
                    $query->where('email_id', $email);
                    $query->orWhere('mobile_number', $mobile);
                })
                ->whereHas('restaurant_user', function ($query) use ($restaurantId) {
                    $query->where('restaurant_id', $restaurantId);
                })->first();
            if ($user) {
                DB::beginTransaction();
                //$user->otp = mt_rand(Config::get('constantsOTP_NO_OF_DIGIT'), 9999);
                $user->otp = 1234;
                $user->otp_valid_time = Carbon::now()->addMinutes(Config::get('constants.OTP_VALID_DURATION'));
                $user->save();
---
select * from `users` where `role` = 'CUSTOMER' and (`email_id` = 'jerykhenson@gmail.com' or `mobile_number` = '8141246885') and exists (select * from `restaurant_users` where `users`.`uid` = `restaurant_users`.`uid` and `restaurant_id` = '1') and `users`.`deleted_at` is null limit 1
update `users` set `otp_valid_time` = '2024-11-19 12:18:16', `users`.`updated_at` = '2024-11-19 12:03:16' where `uid` = 252