app/Models/Cart.php

    public function getModifierWithMenuTotalAttribute(){
        // return $this->cartMenuItems->where('modifier_total',0.00)->sum('menu_total');
        return $this->cartMenuItems->sum('menu_total');
---
select * from `cart_menu_items` where `cart_menu_items`.`cart_id` = 175 and `cart_menu_items`.`cart_id` is not null