app/Models/CartItem.php

    public function getLoyaltyEnableAttribute()
    {
        $menuid = $this->menu_id;
        $redeem_status=$this->redeem_status;

        $loyaltyitem=LoyaltyRuleItem::where('menu_id', $menuid)->exists();
        $uid = Auth::id();
        $user = User::where('uid', $uid)->first();
        $userPoint = $user->total_points;

        $cartitems=CartItem::where('menu_id',$menuid)->where('redeem_status',0)->get();

        $cartmenuitems=CartItem::select('cart_menu_items.*')->where('redeem_status',1)->get();
---
select * from `menu_items` where `menu_items`.`menu_id` = 360 and `menu_items`.`menu_id` is not null and `menu_id` = 213 limit 1
select `cart_menu_items`.* from `cart_menu_items` where `redeem_status` = 1

    public function getPointAttribute()
    {
        $menuid= $this->menu_id;
        $cartitems=CartItem::where('menu_id',$menuid)->get();
        $loyaltyitem=LoyaltyRuleItem::with('loyaltyRule:rules_id,point')->where('menu_id',$menuid)->get();
        foreach($cartitems as $cartitem)
        {
            foreach($loyaltyitem as $loyalty)
            {
                $uid = Auth::id();
                $user=User::where('uid',$uid)->first();
                $point=$user->total_points;
                $loyaltyrule=LoyaltyRule::get();
---
select `rules_id`, `point` from `restaurant_loyalty_rules` where `restaurant_loyalty_rules`.`rules_id` in (2)
select * from `users` where `uid` = 2 and `users`.`deleted_at` is null limit 1
select * from `restaurant_loyalty_rules`

    public function getLoyaltyidAttribute()
    {
        $menuid= $this->menu_id;
        $cartitems=CartItem::where('menu_id',$menuid)->get();
        $loyaltyitem=LoyaltyRuleItem::with('loyaltyRule:rules_id,point')->where('menu_id',$menuid)->get();
        foreach($cartitems as $cartitem)
        {
            foreach($loyaltyitem as $loyalty)
            {
                $uid = Auth::id();
                $user=User::where('uid',$uid)->first();
                $point=$user->total_points;
                $loyaltyrule=LoyaltyRule::get();
---
select `rules_id`, `point` from `restaurant_loyalty_rules` where `restaurant_loyalty_rules`.`rules_id` in (2)
select * from `users` where `uid` = 2 and `users`.`deleted_at` is null limit 1
select * from `restaurant_loyalty_rules`

    public function image($id)
    {
        return $this->hasOne(MenuItem::class, 'menu_id')->where('menu_id', $id)->first();
---
select * from `menu_items` where `menu_items`.`menu_id` = 360 and `menu_items`.`menu_id` is not null and `menu_id` = 213 limit 1